# ValueString Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..ValueString Property
Dimension Class See Also
---
The dimension value as a user visible string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string ValueString { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ValueString As String
	Get
```

Visual C++
---
```text
public:
property String^ ValueString {
	String^ get ();
}
```

# Remarks
This property always return nullNothingnullptra null reference (Nothing in Visual Basic) if this is a spot dimension, or it is a linear dimension with more than one segments.
# See Also
Dimension Class
Autodesk.Revit.DB Namespace